# Именные аргументы. Неограниченные именные аргументы

def how_much(price, quantity):
    return price * quantity

# У функции два аргумента. Оба - именные, но можно передать их
# по позиции

def how_much_total(**goods):
    # Две звездочки означают, что все переданные аргументы 
    # превратятся в словарь, где ключом будет строка, а значением - значение 
    # переданного аргумента!
    result = 0
    for thing in goods:
        print(thing, ' стоит ', goods[thing])
        result += goods[thing]
    return result
    
print(how_much_total(
    shoes=4500, flowers=1200, chocolate=50))

# Правило: 
#     сначала обычные аргументы с именами, 
#     потом неограниченные позиционные, 
#     потом - неограниченные, строго именные, которые иначе не передать

# Написать функцию, принимающю любое количество любых аргументов
# Функция должна вернуть общее количество всех своих аргументов
# Если вы очень крут, то ещё она должна вернуть список названий 
# всех строго именных аргументов