# 1. Создать список чисел от 1 до 10 (вручную или через random)
# Числа не должны идти подряд и их должно быть штук 7
# Числа могут повторяться
# 1.1. Написать программу, которая проверяет, есть ли число
# в списке (например, введенное с клавиатуры)
# 1.2. Написать функцию, которая возвращает номер позиции,
# если число найдено и None, если не найдено
#
# Кубики, которыми можно пользоваться:
# while, if
# +=
# -=
# [] (обращение по номеру позиции в списке)

def in_my_list(lst, num):
    '''Функция получает на вход список и число.
       Возвращает True, если число есть в списке и 
       False, если числа в списке нет
       num in lst
    ''' # 1.2. Написать функцию, которая возвращает номер позиции, если нашли
    # 1. Создать переменную-индекс для номера позиции, присвоить ей 0 
    # 2. ПОКА переменная-индекс строго меньше длины списка
    #    2.1 Получить значение по индексу (позиции) 
    #    2.2 ЕСЛИ значение по индексу РАВНО искомому числу, вернуть истину ИЛИ ИНДЕКС 
    #    2.3 Перейти к следующей позиции: увеличить индекс на 1
    # 3. Переменная-индекс превысила или стала равна длине списка 
    # 4. Мы не нашли наше число.
    # 5. ВЕРНУТЬ None
    spisok_positii = []
    i = 0  # ИНДЕКС
    while i < len(lst):
        if lst[i] == num:
            spisok_positii += [i]  # spisok_positii.append(i)
        i += 1
    return spisok_positii  # До 21:20

# позиции  0  1  2  3  4  5  6  7
numlist = [3, 2, 8, 4, 5, 3, 9, 6]
n1 = 3
n2 = 6
n3 = 4
n4 = 1
print(numlist, n1, in_my_list(numlist, n1))
print(numlist, n2, in_my_list(numlist, n2))
print(numlist, n3, in_my_list(numlist, n3))
print(numlist, n4, in_my_list(numlist, n4))